In [2]:
import pandas as pd
obj=pd.Series([4, 7 , -5, 3],index=['a', 'b', 'c', 'd'])
obj

a    4
b    7
c   -5
d    3
dtype: int64

In [3]:
obj['a']

4

In [4]:
obj[['a', 'b', 'c']]

a    4
b    7
c   -5
dtype: int64

In [6]:
sdata = {'台北':35000, '桃園':71000, '台中':16000, '高雄':5000}
states = ['花蓮','高雄', '台中', '台北']
obj2=pd.Series(sdata)
obj2

台北    35000
桃園    71000
台中    16000
高雄     5000
dtype: int64

In [8]:
obj2.name = '人口數'
obj2

台北    35000
桃園    71000
台中    16000
高雄     5000
Name: 人口數, dtype: int64

In [9]:
obj2.index.name='地區'
obj2

地區
台北    35000
桃園    71000
台中    16000
高雄     5000
Name: 人口數, dtype: int64

In [21]:
import csv
import pandas as pd

with open('新北市食品工廠清冊.csv','r',encoding='utf-8') as file:
    next(file)
    temp = csv.reader(file)
    dict={item[1]:item[0] for item in temp}
    
stores = pd.Series(dict)
stores.name = '工廠統編清冊'
stores.index.name='統一編號'

統一編號
99611344             鴻輝食品廠
99604192       廣達香食品股份有限公司
99613990             順發糧食行
99600477      台灣塩野香料股份有限公司
99606467      圓金釀造食品股份有限公司
                 ...
65007117    元茂農產企業股份有限公司二廠
65007172         萬寶客股份有限公司
65007211          昆帝食品有限公司
65007246       嚐鱻食品有限公司板橋廠
65007247          崴欣國際有限公司
Name: 工廠統編清冊, Length: 1232, dtype: object

In [22]:
#DataFrame
data = {
    '縣市': ['台北','台北','台北', '新竹', '新竹', '新竹'],
    '年份': [2000, 2001, 2002, 2001, 2002, 2003],
    '人口': [2.2, 2.5, 2.7, 1.1, 1.5, 2.0]
}
frame = pd.DataFrame(data)
frame

   縣市    年份   人口
0  台北  2000  2.2
1  台北  2001  2.5
2  台北  2002  2.7
3  新竹  2001  1.1
4  新竹  2002  1.5
5  新竹  2003  2.0

In [23]:
frame['縣市']

0    台北
1    台北
2    台北
3    新竹
4    新竹
5    新竹
Name: 縣市, dtype: object

In [25]:
frame['年份']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: 年份, dtype: int64

In [26]:
frame['人口']

0    2.2
1    2.5
2    2.7
3    1.1
4    1.5
5    2.0
Name: 人口, dtype: float64

In [27]:
#重新排序欄位順序
data = {
    '縣市': ['台北','台北','台北', '新竹', '新竹', '新竹'],
    '年份': [2000, 2001, 2002, 2001, 2002, 2003],
    '人口': [2.2, 2.5, 2.7, 1.1, 1.5, 2.0]
}
frame2=pd.DataFrame(data,columns=['年份','縣市','人口'])
frame2

     年份  縣市   人口
0  2000  台北  2.2
1  2001  台北  2.5
2  2002  台北  2.7
3  2001  新竹  1.1
4  2002  新竹  1.5
5  2003  新竹  2.0

In [28]:
frame2[:3]

     年份  縣市   人口
0  2000  台北  2.2
1  2001  台北  2.5
2  2002  台北  2.7

In [31]:
frame2[:1]

     年份  縣市   人口
0  2000  台北  2.2

In [32]:
frame2

     年份  縣市   人口
0  2000  台北  2.2
1  2001  台北  2.5
2  2002  台北  2.7
3  2001  新竹  1.1
4  2002  新竹  1.5
5  2003  新竹  2.0

In [35]:
frame2.loc[:,'人口']

0    2.2
1    2.5
2    2.7
3    1.1
4    1.5
5    2.0
Name: 人口, dtype: float64

In [36]:
frame2.loc[0,'人口']

2.2

In [38]:
frame2['負債'] = 16.5

In [40]:
frame2['負債'] = range(16,22)

In [41]:
frame2

     年份  縣市   人口  負債
0  2000  台北  2.2  16
1  2001  台北  2.5  17
2  2002  台北  2.7  18
3  2001  新竹  1.1  19
4  2002  新竹  1.5  20
5  2003  新竹  2.0  21

In [43]:
frame2['負債'] = pd.Series([20, 21, 22, 23, 24, 25])
frame2

     年份  縣市   人口  負債
0  2000  台北  2.2  20
1  2001  台北  2.5  21
2  2002  台北  2.7  22
3  2001  新竹  1.1  23
4  2002  新竹  1.5  24
5  2003  新竹  2.0  25

In [45]:
frame2.iloc[:,2:4]

    人口  負債
0  2.2  20
1  2.5  21
2  2.7  22
3  1.1  23
4  1.5  24
5  2.0  25

In [46]:
frame2.dtypes

年份      int64
縣市     object
人口    float64
負債      int64
dtype: object

In [47]:
frame2.values

array([[2000, '台北', 2.2, 20],
       [2001, '台北', 2.5, 21],
       [2002, '台北', 2.7, 22],
       [2001, '新竹', 1.1, 23],
       [2002, '新竹', 1.5, 24],
       [2003, '新竹', 2.0, 25]], dtype=object)

In [48]:
frame2.index

RangeIndex(start=0, stop=6, step=1)

In [49]:
frame2.columns

Index(['年份', '縣市', '人口', '負債'], dtype='object')

In [51]:
frame2.columns = ['年份1', '縣市1', '人口1', '負債1']
frame2

    年份1 縣市1  人口1  負債1
0  2000  台北  2.2   20
1  2001  台北  2.5   21
2  2002  台北  2.7   22
3  2001  新竹  1.1   23
4  2002  新竹  1.5   24
5  2003  新竹  2.0   25

In [52]:
frame2.index = ['第一天','第二天','第三天','第四天','第五天','第六天']

In [53]:
frame2

      年份1 縣市1  人口1  負債1
第一天  2000  台北  2.2   20
第二天  2001  台北  2.5   21
第三天  2002  台北  2.7   22
第四天  2001  新竹  1.1   23
第五天  2002  新竹  1.5   24
第六天  2003  新竹  2.0   25

In [56]:
#使用del運算子
del frame2['負債1']

In [57]:
frame2

      年份1 縣市1  人口1
第一天  2000  台北  2.2
第二天  2001  台北  2.5
第三天  2002  台北  2.7
第四天  2001  新竹  1.1
第五天  2002  新竹  1.5
第六天  2003  新竹  2.0

In [58]:
frame2.T

      第一天   第二天   第三天   第四天   第五天   第六天
年份1  2000  2001  2002  2001  2002  2003
縣市1    台北    台北    台北    新竹    新竹    新竹
人口1   2.2   2.5   2.7   1.1   1.5     2

In [59]:
frame2

      年份1 縣市1  人口1
第一天  2000  台北  2.2
第二天  2001  台北  2.5
第三天  2002  台北  2.7
第四天  2001  新竹  1.1
第五天  2002  新竹  1.5
第六天  2003  新竹  2.0

In [60]:
frame2['年份1']

第一天    2000
第二天    2001
第三天    2002
第四天    2001
第五天    2002
第六天    2003
Name: 年份1, dtype: int64

In [61]:
frame2.年份1

第一天    2000
第二天    2001
第三天    2002
第四天    2001
第五天    2002
第六天    2003
Name: 年份1, dtype: int64